
                           Design Compiler Graphical 
                                 DC Ultra (TM)
                                  DFTMAX (TM)
                              Power Compiler (TM)
                                 DesignWare (R)
                                 DC Expert (TM)
                               Design Vision (TM)
                               HDL Compiler (TM)
                               VHDL Compiler (TM)
                                  DFT Compiler
                               Design Compiler(R)

               Version U-2022.12-SP4 for linux64 - May 23, 2023 

                    Copyright (c) 1988 - 2023 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
   or distribution of this software is strictly prohibited.  Licensed Products
     communicate with Synopsys servers for the purpose of providing software
    updates, detecting software piracy and verifying that customers are using
    Licensed Products in conformity with the applicable License Key for such
  Licensed Products. Synopsys will use information gathered in connection with
    this process to deliver software updates and pursue software pirates and
                                   infringers.

 Inclusivity & Diversity - Visit SolvNetPlus to read the "Synopsys Statement on
            Inclusivity and Diversity" (Refer to article 000036315 at
                        https://solvnetplus.synopsys.com)
Initializing...
Initializing gui preferences from file  /home/aigbe/.synopsys_dc_gui/preferences.tcl
suppress_message CMD-041
set script_name dcs
dcs
set licenses_not_required [list DesignWare VHDL-Compiler]
DesignWare VHDL-Compiler
set load_designware_libraries true
true
set use_lvt_link_lib true
true
set use_hvt_link_lib true
true
source ../scripts/project.tcl
Error: could not open script file "../scripts/project.tcl" (CMD-015)
if {$version != {default}} {
    read_file -format $format $input_file
    
    if { $type == "bc" || $type == "wc" || [string match "ocv*" $type] } {
    
        if { [string match "ocv*" $type] } {
            puts "Er\ror: OCV not supported in dc_shell"
        }
        
        puts "Information: Removing local_link_library attribute from current_design to allow desired link library to take effect. (SS-00?)"
        remove_attribute [current_design] local_link_library
        link
    
    } elseif {$type != {}} {
        current_design $type
    }
}
Error: can't read "version": no such variable
	Use error_info for more info. (CMD-013)
dc_shell> cd ..
dc_shell> set link_library {db/sclib_tigfet10_hpnw4_tt_0p70v_25c.db}
db/sclib_tigfet10_hpnw4_tt_0p70v_25c.db
dc_shell> set target_library {db/sclib_tigfet10_hpnw4_tt_0p70v_25c.db}
db/sclib_tigfet10_hpnw4_tt_0p70v_25c.db
dc_shell> # set link_library {/shared/hwmisc/apps/synopsys/syn/2022.12-SP4/libraries/syn/gtech.db}
dc_shell> # set target_library {/shared/hwmisc/apps/synopsys/syn/2022.12-SP4/libraries/syn/gtech.db}
dc_shell> define_design_lib WORK -path ./work
1
dc_shell> 
dc_shell> set_svf results/analyze_computer.svf
1
dc_shell> 
dc_shell> analyze -format vhdl -work work src/ALU.vhd 
Running PRESTO HDLC
Compiling Entity Declaration ALU
Compiling Architecture BEHAVIORAL of ALU
Warning:  ./src/ALU.vhd:16: The architecture Behavioral has already been analyzed. It is being replaced. (VHD-4)
Presto compilation completed successfully.
Loading db file '/work/aigbe/syn/q6chip/syn/runs1/brcm3_test_240725/PC_project/db/sclib_tigfet10_hpnw4_tt_0p70v_25c.db'
1
dc_shell> analyze -format vhdl -work work src/rom_128x8_sync.vhd
Running PRESTO HDLC
Compiling Entity Declaration ROM_128X8_SYNC
Compiling Architecture BEHAVIORAL of ROM_128X8_SYNC
Warning:  ./src/rom_128x8_sync.vhd:15: The architecture Behavioral has already been analyzed. It is being replaced. (VHD-4)
Presto compilation completed successfully.
1
dc_shell> analyze -format vhdl -work work src/rw_96x8_sync.vhd
Running PRESTO HDLC
Compiling Entity Declaration RW_96X8_SYNC
Compiling Architecture BEHAVIORAL of RW_96X8_SYNC
Warning:  ./src/rw_96x8_sync.vhd:18: The architecture Behavioral has already been analyzed. It is being replaced. (VHD-4)
Presto compilation completed successfully.
1
dc_shell> analyze -format vhdl -work work src/Output_Ports.vhd
Running PRESTO HDLC
Compiling Entity Declaration OUTPUT_PORTS
Compiling Architecture BEHAVIORAL of OUTPUT_PORTS
Warning:  ./src/Output_Ports.vhd:33: The architecture Behavioral has already been analyzed. It is being replaced. (VHD-4)
Presto compilation completed successfully.
1
dc_shell> analyze -format vhdl -work work src/memory.vhd
Running PRESTO HDLC
Compiling Entity Declaration MEMORY
Compiling Architecture MEM_ARC of MEMORY
Warning:  ./src/memory.vhd:51: The architecture mem_arc has already been analyzed. It is being replaced. (VHD-4)
Presto compilation completed successfully.
1
dc_shell> analyze -format vhdl -work work src/data_path.vhd
Running PRESTO HDLC
Compiling Entity Declaration DATA_PATH
Compiling Architecture BEHAVIORAL of DATA_PATH
Warning:  ./src/data_path.vhd:33: The architecture Behavioral has already been analyzed. It is being replaced. (VHD-4)
Presto compilation completed successfully.
1
dc_shell> analyze -format vhdl -work work src/control_unit.vhd
Running PRESTO HDLC
Compiling Entity Declaration CONTROL_UNIT
Compiling Architecture BEHAVIORAL of CONTROL_UNIT
Warning:  ./src/control_unit.vhd:25: The architecture Behavioral has already been analyzed. It is being replaced. (VHD-4)
Presto compilation completed successfully.
1
dc_shell> analyze -format vhdl -work work src/cpu.vhd
Running PRESTO HDLC
Compiling Entity Declaration CPU
Compiling Architecture BEHAVIORAL of CPU
Warning:  ./src/cpu.vhd:17: The architecture Behavioral has already been analyzed. It is being replaced. (VHD-4)
Presto compilation completed successfully.
1
dc_shell> analyze -format vhdl -work work src/computer.vhd
Running PRESTO HDLC
Compiling Entity Declaration COMPUTER
Compiling Architecture COMP_ARC of COMPUTER
Warning:  ./src/computer.vhd:43: The architecture comp_arc has already been analyzed. It is being replaced. (VHD-4)
Presto compilation completed successfully.
1
dc_shell> 
dc_shell> set_svf results/elab_computer.svf
1
dc_shell> elaborate computer -work work
Loading db file '/shared/hwmisc/apps/synopsys/syn/2022.12-SP4/libraries/syn/gtech.db'
Loading db file '/shared/hwmisc/apps/synopsys/syn/2022.12-SP4/libraries/syn/standard.sldb'
  Loading link library 'sclib_tigfet10_hpnw4_tt_0p70v_25c'
  Loading link library 'gtech'
Running PRESTO HDLC
Presto compilation completed successfully. (computer)
Elaborated 1 design.
Current design is now 'computer'.
Information: Building the design 'cpu'. (HDL-193)
Presto compilation completed successfully. (cpu)
Information: Building the design 'memory'. (HDL-193)
Presto compilation completed successfully. (memory)
Information: Building the design 'control_unit'. (HDL-193)

Statistics for case statements in always block at line 42 in file
	'./src/control_unit.vhd'
===============================================
|           Line           |  full/ parallel  |
===============================================
|            55            |    auto/auto     |
===============================================

Inferred memory devices in process
	in routine control_unit line 34 in file
		'./src/control_unit.vhd'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|  current_state_reg  | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine control_unit line 42 in file
		'./src/control_unit.vhd'.
===========================================================================
|    Register Name    | Type  | Width | Bus | MB | AR | AS | SR | SS | ST |
===========================================================================
|   next_state_reg    | Latch |   4   |  Y  | N  | N  | N  | -  | -  | -  |
===========================================================================
Presto compilation completed successfully. (control_unit)
Information: Building the design 'data_path'. (HDL-193)

Inferred memory devices in process
	in routine data_path line 47 in file
		'./src/data_path.vhd'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     IR_Reg_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine data_path line 59 in file
		'./src/data_path.vhd'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|       MAR_reg       | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine data_path line 71 in file
		'./src/data_path.vhd'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|       PC_reg        | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine data_path line 84 in file
		'./src/data_path.vhd'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|      A_Reg_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine data_path line 95 in file
		'./src/data_path.vhd'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|      B_Reg_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine data_path line 115 in file
		'./src/data_path.vhd'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|       CCR_reg       | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully. (data_path)
Information: Building the design 'rom_128x8_sync'. (HDL-193)
Warning:  ./src/rom_128x8_sync.vhd:17: The initial value for signal 'ROM' is not supported for synthesis. Presto ignores it.  (ELAB-130)

Inferred memory devices in process
	in routine rom_128x8_sync line 52 in file
		'./src/rom_128x8_sync.vhd'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|    data_out_reg     | Flip-flop |   8   |  Y  | N  | N  | N  | N  | N  | N  |
===============================================================================
Statistics for MUX_OPs
=======================================================
| block name/line   | Inputs | Outputs | # sel inputs |
=======================================================
| rom_128x8_sync/55 |  128   |    1    |      7       |
=======================================================
Presto compilation completed successfully. (rom_128x8_sync)
Information: Building the design 'rw_96x8_sync'. (HDL-193)
Warning:  ./src/rw_96x8_sync.vhd:20: The initial value for signal 'RAM' is not supported for synthesis. Presto ignores it.  (ELAB-130)

Inferred memory devices in process
	in routine rw_96x8_sync line 47 in file
		'./src/rw_96x8_sync.vhd'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|       RAM_reg       | Flip-flop |  768  |  Y  | N  | N  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully. (rw_96x8_sync)
Information: Building the design 'Output_Ports'. (HDL-193)
Warning:  ./src/Output_Ports.vhd:35: The initial value for signal 'RAM' is not supported for synthesis. Presto ignores it.  (ELAB-130)

Inferred memory devices in process
	in routine Output_Ports line 43 in file
		'./src/Output_Ports.vhd'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|       RAM_reg       | Flip-flop |  128  |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully. (Output_Ports)
Information: Building the design 'ALU'. (HDL-193)

Statistics for case statements in always block at line 21 in file
	'./src/ALU.vhd'
===============================================
|           Line           |  full/ parallel  |
===============================================
|            24            |    auto/auto     |
===============================================

Statistics for case statements in always block at line 50 in file
	'./src/ALU.vhd'
===============================================
|           Line           |  full/ parallel  |
===============================================
|            50            |    auto/auto     |
===============================================

Statistics for case statements in always block at line 55 in file
	'./src/ALU.vhd'
===============================================
|           Line           |  full/ parallel  |
===============================================
|            55            |    auto/auto     |
===============================================
Presto compilation completed successfully. (ALU)
1
dc_shell> 
dc_shell> # source timing.tcl
dc_shell> # set_compile_options
dc_shell> set_svf ../PC_project/results/compile_computer.svf
1
dc_shell> # compile_ultra -scan -no_autoungroup -no_seq_output_inversion
dc_shell> compile -map_effort low
Warning: The compile -map_effort low is obsolete. Setting this variable now defaults to compile -map_effort medium. Please update your script accordingly. (OPT-1303)
Information: Evaluating DesignWare library utilization. (UISN-27)

============================================================================
| DesignWare Building Block Library  |         Version         | Available |
============================================================================
| Basic DW Building Blocks           | U-2022.12-DWBB_202212.4 |     *     |
| Licensed DW Building Blocks        |                         |           |
============================================================================

====================================================================================================
| Flow Information                                                                                 |
----------------------------------------------------------------------------------------------------
| Flow         | Design Compiler                                                                   |
====================================================================================================
| Design Information                                      | Value                                  |
====================================================================================================
| Number of Scenarios                                     | 0                                      |
| Leaf Cell Count                                         | 2640                                   |
| Number of User Hierarchies                              | 8                                      |
| Sequential Cell Count                                   | 956                                    |
| Macro Count                                             | 0                                      |
| Number of Power Domains                                 | 0                                      |
| Number of Path Groups                                   | 1                                      |
| Number of VT Class                                      | 0                                      |
| Number of Clocks                                        | 0                                      |
| Number of Dont Touch Cells                              | 272                                    |
| Number of Dont Touch Nets                               | 0                                      |
| Number of Size Only Cells                               | 0                                      |
| Design with UPF Data                                    | false                                  |
====================================================================================================

Information: There are 12 potential problems in your design. Please run 'check_design' for more information. (LINT-99)



  Beginning Pass 1 Mapping
  ------------------------
  Processing 'Output_Ports'
Warning: The register RAM_reg[0][7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[0][6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[0][5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[0][4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[0][3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[0][2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[0][1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[0][0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[1][7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[1][6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[1][5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[1][4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[1][3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[1][2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[1][1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[1][0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[2][7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[2][6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[2][5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[2][4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[2][3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[2][2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[2][1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[2][0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[3][7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[3][6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[3][5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[3][4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[3][3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[3][2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[3][1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[3][0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[4][7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[4][6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[4][5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[4][4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[4][3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[4][2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[4][1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[4][0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[5][7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[5][6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[5][5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[5][4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[5][3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[5][2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[5][1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[5][0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[6][7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[6][6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[6][5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[6][4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[6][3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[6][2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[6][1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[6][0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[7][7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[7][6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[7][5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[7][4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[7][3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[7][2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[7][1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[7][0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[8][7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[8][6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[8][5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[8][4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[8][3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[8][2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[8][1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[8][0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[9][7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[9][6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[9][5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[9][4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[9][3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[9][2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[9][1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[9][0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[10][7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[10][6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[10][5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[10][4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[10][3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[10][2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[10][1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[10][0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[11][7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[11][6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[11][5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[11][4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[11][3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[11][2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[11][1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[11][0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[12][7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[12][6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[12][5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[12][4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[12][3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[12][2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[12][1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[12][0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[13][7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[13][6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[13][5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[13][4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[13][3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[13][2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[13][1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[13][0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[14][7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[14][6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[14][5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[14][4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[14][3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[14][2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[14][1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[14][0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[15][7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[15][6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[15][5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[15][4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[15][3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[15][2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[15][1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register RAM_reg[15][0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: Target library contains no replacement for register 'RAM_reg[0][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[0][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[0][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[0][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[0][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[0][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[0][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[0][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[1][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[1][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[1][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[1][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[1][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[1][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[1][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[1][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[2][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[2][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[2][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[2][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[2][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[2][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[2][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[2][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[3][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[3][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[3][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[3][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[3][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[3][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[3][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[3][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[4][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[4][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[4][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[4][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[4][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[4][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[4][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[4][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[5][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[5][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[5][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[5][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[5][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[5][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[5][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[5][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[6][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[6][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[6][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[6][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[6][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[6][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[6][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[6][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[7][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[7][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[7][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[7][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[7][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[7][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[7][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[7][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[8][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[8][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[8][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[8][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[8][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[8][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[8][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[8][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[9][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[9][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[9][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[9][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[9][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[9][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[9][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[9][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[10][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[10][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[10][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[10][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[10][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[10][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[10][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[10][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[11][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[11][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[11][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[11][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[11][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[11][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[11][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[11][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[12][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[12][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[12][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[12][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[12][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[12][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[12][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[12][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[13][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[13][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[13][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[13][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[13][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[13][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[13][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[13][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[14][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[14][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[14][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[14][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[14][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[14][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[14][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[14][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[15][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[15][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[15][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[15][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[15][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[15][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[15][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'RAM_reg[15][0]' (**FFGEN**). (TRANS-4)
  Processing 'rw_96x8_sync'
  Processing 'rom_128x8_sync'
Information: The register 'data_out_reg[7]' is a constant and will be removed. (OPT-1206)
Information: The register 'data_out_reg[6]' is a constant and will be removed. (OPT-1206)
Information: The register 'data_out_reg[5]' is a constant and will be removed. (OPT-1206)
Information: The register 'data_out_reg[4]' is a constant and will be removed. (OPT-1206)
Information: The register 'data_out_reg[3]' is a constant and will be removed. (OPT-1206)
Information: The register 'data_out_reg[2]' is a constant and will be removed. (OPT-1206)
Information: The register 'data_out_reg[1]' is a constant and will be removed. (OPT-1206)
Information: The register 'data_out_reg[0]' is a constant and will be removed. (OPT-1206)
  Processing 'memory'
  Processing 'ALU'
  Processing 'data_path'
Warning: The register B_Reg_reg[0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register PC_reg[0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register PC_reg[7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register B_Reg_reg[7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register PC_reg[1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register B_Reg_reg[1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register A_Reg_reg[1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register MAR_reg[1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register IR_Reg_reg[1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register PC_reg[2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register B_Reg_reg[2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register A_Reg_reg[2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register MAR_reg[2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register IR_Reg_reg[2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register PC_reg[3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register B_Reg_reg[3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register A_Reg_reg[3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register MAR_reg[3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register IR_Reg_reg[3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register PC_reg[4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register B_Reg_reg[4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register A_Reg_reg[4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register MAR_reg[4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register IR_Reg_reg[4] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register PC_reg[5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register B_Reg_reg[5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register A_Reg_reg[5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register MAR_reg[5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register IR_Reg_reg[5] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register PC_reg[6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register B_Reg_reg[6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register A_Reg_reg[6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register MAR_reg[6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register IR_Reg_reg[6] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register A_Reg_reg[7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register MAR_reg[7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register IR_Reg_reg[7] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register A_Reg_reg[0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register MAR_reg[0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register IR_Reg_reg[0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register CCR_reg[3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register CCR_reg[2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register CCR_reg[1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register CCR_reg[0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: Target library contains no replacement for register 'B_Reg_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'PC_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'PC_reg[7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'B_Reg_reg[7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'PC_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'B_Reg_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'A_Reg_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MAR_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'IR_Reg_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'PC_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'B_Reg_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'A_Reg_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MAR_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'IR_Reg_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'PC_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'B_Reg_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'A_Reg_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MAR_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'IR_Reg_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'PC_reg[4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'B_Reg_reg[4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'A_Reg_reg[4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MAR_reg[4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'IR_Reg_reg[4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'PC_reg[5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'B_Reg_reg[5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'A_Reg_reg[5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MAR_reg[5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'IR_Reg_reg[5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'PC_reg[6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'B_Reg_reg[6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'A_Reg_reg[6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MAR_reg[6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'IR_Reg_reg[6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'A_Reg_reg[7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MAR_reg[7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'IR_Reg_reg[7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'A_Reg_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MAR_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'IR_Reg_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CCR_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CCR_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CCR_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CCR_reg[0]' (**FFGEN**). (TRANS-4)
  Processing 'control_unit'
Warning: The register current_state_reg[0] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register current_state_reg[3] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register current_state_reg[2] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: The register current_state_reg[1] does not have valid compatible libcell. This register may not be mapped as intended. (OPT-1235)
Warning: Target library contains no replacement for register 'current_state_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'current_state_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'current_state_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'current_state_reg[1]' (**FFGEN**). (TRANS-4)
  Processing 'cpu'
  Processing 'computer'

  Updating timing information
Information: Updating design information... (UID-85)
Information: Design 'computer' has no optimization constraints set. (OPT-108)

  Beginning Implementation Selection
  ----------------------------------
  Processing 'memory_DW01_cmp2_0'
  Processing 'memory_DW01_cmp2_1'
  Processing 'data_path_DW01_inc_0'
  Processing 'ALU_DW01_sub_0'
  Processing 'ALU_DW01_add_0'
  Processing 'control_unit_DW01_cmp2_0_DW01_cmp2_2'
  Processing 'control_unit_DW01_cmp2_1_DW01_cmp2_3'
  Processing 'control_unit_DW01_cmp2_2_DW01_cmp2_4'
  Processing 'control_unit_DW01_cmp2_3_DW01_cmp2_5'
  Processing 'control_unit_DW01_cmp2_4_DW01_cmp2_6'
  Processing 'control_unit_DW01_cmp2_5_DW01_cmp2_7'
Information: Command 'do_operand_isolation' is obsolete and is being ignored.  Please refer to the replacement command 'set power_enable_datapath_gating true' instead. (INFO-118)
Warning: Target library contains no replacement for register 'CPU_1/control_unit_module/current_state_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/control_unit_module/current_state_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/control_unit_module/current_state_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/control_unit_module/current_state_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/CCR_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/CCR_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/CCR_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/CCR_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/IR_Reg_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/MAR_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/A_Reg_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/IR_Reg_reg[7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/MAR_reg[7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/A_Reg_reg[7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/IR_Reg_reg[6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/MAR_reg[6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/A_Reg_reg[6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/B_Reg_reg[6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/PC_reg[6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/IR_Reg_reg[5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/MAR_reg[5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/A_Reg_reg[5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/B_Reg_reg[5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/PC_reg[5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/IR_Reg_reg[4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/MAR_reg[4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/A_Reg_reg[4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/B_Reg_reg[4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/PC_reg[4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/IR_Reg_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/MAR_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/A_Reg_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/B_Reg_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/PC_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/IR_Reg_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/MAR_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/A_Reg_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/B_Reg_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/PC_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/IR_Reg_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/MAR_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/A_Reg_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/B_Reg_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/PC_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/B_Reg_reg[7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/PC_reg[7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/PC_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/B_Reg_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[15][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[15][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[15][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[15][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[15][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[15][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[15][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[15][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[14][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[14][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[14][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[14][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[14][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[14][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[14][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[14][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[13][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[13][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[13][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[13][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[13][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[13][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[13][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[13][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[12][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[12][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[12][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[12][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[12][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[12][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[12][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[12][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[11][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[11][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[11][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[11][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[11][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[11][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[11][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[11][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[10][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[10][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[10][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[10][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[10][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[10][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[10][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[10][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[9][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[9][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[9][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[9][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[9][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[9][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[9][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[9][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[8][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[8][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[8][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[8][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[8][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[8][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[8][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[8][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[7][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[7][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[7][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[7][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[7][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[7][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[7][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[7][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[6][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[6][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[6][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[6][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[6][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[6][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[6][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[6][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[5][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[5][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[5][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[5][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[5][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[5][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[5][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[5][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[4][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[4][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[4][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[4][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[4][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[4][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[4][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[4][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[3][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[3][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[3][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[3][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[3][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[3][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[3][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[3][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[2][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[2][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[2][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[2][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[2][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[2][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[2][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[2][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[1][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[1][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[1][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[1][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[1][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[1][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[1][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[1][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[0][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[0][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[0][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[0][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[0][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[0][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[0][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[0][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/control_unit_module/current_state_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/control_unit_module/current_state_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/control_unit_module/current_state_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/control_unit_module/current_state_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/B_Reg_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/PC_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/PC_reg[7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/B_Reg_reg[7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/PC_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/B_Reg_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/A_Reg_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/MAR_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/IR_Reg_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/PC_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/B_Reg_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/A_Reg_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/MAR_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/IR_Reg_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/PC_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/B_Reg_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/A_Reg_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/MAR_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/IR_Reg_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/PC_reg[4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/B_Reg_reg[4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/A_Reg_reg[4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/MAR_reg[4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/IR_Reg_reg[4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/PC_reg[5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/B_Reg_reg[5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/A_Reg_reg[5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/MAR_reg[5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/IR_Reg_reg[5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/PC_reg[6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/B_Reg_reg[6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/A_Reg_reg[6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/MAR_reg[6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/IR_Reg_reg[6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/A_Reg_reg[7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/MAR_reg[7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/IR_Reg_reg[7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/A_Reg_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/MAR_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/IR_Reg_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/CCR_reg[3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/CCR_reg[2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/CCR_reg[1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'CPU_1/data_path_u/CCR_reg[0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[0][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[0][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[0][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[0][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[0][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[0][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[0][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[0][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[1][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[1][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[1][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[1][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[1][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[1][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[1][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[1][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[2][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[2][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[2][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[2][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[2][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[2][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[2][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[2][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[3][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[3][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[3][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[3][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[3][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[3][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[3][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[3][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[4][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[4][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[4][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[4][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[4][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[4][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[4][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[4][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[5][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[5][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[5][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[5][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[5][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[5][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[5][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[5][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[6][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[6][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[6][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[6][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[6][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[6][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[6][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[6][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[7][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[7][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[7][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[7][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[7][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[7][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[7][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[7][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[8][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[8][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[8][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[8][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[8][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[8][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[8][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[8][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[9][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[9][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[9][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[9][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[9][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[9][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[9][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[9][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[10][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[10][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[10][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[10][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[10][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[10][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[10][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[10][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[11][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[11][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[11][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[11][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[11][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[11][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[11][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[11][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[12][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[12][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[12][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[12][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[12][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[12][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[12][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[12][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[13][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[13][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[13][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[13][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[13][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[13][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[13][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[13][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[14][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[14][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[14][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[14][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[14][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[14][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[14][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[14][0]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[15][7]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[15][6]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[15][5]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[15][4]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[15][3]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[15][2]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[15][1]' (**FFGEN**). (TRANS-4)
Warning: Target library contains no replacement for register 'MEM_1/Output_Ports_u/RAM_reg[15][0]' (**FFGEN**). (TRANS-4)

  Beginning Mapping Optimizations  (Medium effort)
  -------------------------------
  Structuring 'ALU'
  Mapping 'ALU'
  Structuring 'Output_Ports'
  Mapping 'Output_Ports'
  Structuring 'rw_96x8_sync'
  Mapping 'rw_96x8_sync'
  Structuring 'data_path'
  Mapping 'data_path'
  Structuring 'control_unit'
  Mapping 'control_unit'
  Structuring 'memory'
  Mapping 'memory'
Information: Command 'do_operand_isolation' is obsolete and is being ignored.  Please refer to the replacement command 'set power_enable_datapath_gating true' instead. (INFO-118)

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:04    1078.7      0.00       0.0    4379.7                          
    0:00:04    1078.7      0.00       0.0    4379.7                          

  Beginning Delay Optimization Phase
  ----------------------------------

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:04    1078.7      0.00       0.0    4379.7                          
    0:00:04    1187.4      0.00       0.0    4653.0                          
    0:00:04    1187.4      0.00       0.0    4653.0                          


  Beginning Design Rule Fixing  (min_capacitance)  (max_transition)  (max_capacitance)
  ----------------------------

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:04    1187.4      0.00       0.0    4653.0                          
    0:00:04    1191.5      0.00       0.0    1925.4 CPU_1/control_unit_module/write
    0:00:04    1193.8      0.00       0.0    1851.0 MEM_1/rw_96x8_sync_u/net35742
    0:00:05    1196.9      0.00       0.0    1767.6 MEM_1/rw_96x8_sync_u/net32591
    0:00:05    1204.2      0.00       0.0    1658.9 MEM_1/rw_96x8_sync_u/net30324
    0:00:05    1211.9      0.00       0.0    1555.5 MEM_1/rw_96x8_sync_u/net30522
    0:00:05    1219.7      0.00       0.0    1452.0 MEM_1/rw_96x8_sync_u/net30727
    0:00:05    1227.4      0.00       0.0    1348.4 MEM_1/rw_96x8_sync_u/net30939
    0:00:05    1235.1      0.00       0.0    1244.8 MEM_1/rw_96x8_sync_u/net31140
    0:00:05    1242.6      0.00       0.0    1133.9 MEM_1/rw_96x8_sync_u/net31342
    0:00:05    1248.6      0.00       0.0    1051.9 CPU_1/control_unit_module/B_Load
    0:00:05    1254.1      0.00       0.0     976.2 MEM_1/rw_96x8_sync_u/net30376
    0:00:05    1255.1      0.00       0.0     946.5 MEM_1/rw_96x8_sync_u/net35781
    0:00:05    1260.0      0.00       0.0     873.5 MEM_1/net33511           
    0:00:05    1263.7      0.00       0.0     835.7 MEM_1/rw_96x8_sync_u/net31446
    0:00:05    1269.7      0.00       0.0     721.4 CPU_1/control_unit_module/net36094
    0:00:05    1274.4      0.00       0.0     664.7 MEM_1/net33500           
    0:00:05    1280.9      0.00       0.0     634.2 MEM_1/rw_96x8_sync_u/net34633
    0:00:05    1288.0      0.00       0.0     602.2 MEM_1/rw_96x8_sync_u/net34723
    0:00:06    1295.2      0.00       0.0     570.2 MEM_1/rw_96x8_sync_u/net34813
    0:00:06    1298.8      0.00       0.0     428.4 MEM_1/rw_96x8_sync_u/net38340
    0:00:06    1301.4      0.00       0.0     377.3 CPU_1/data_path_u/ALU_unit/r83/A[7]
    0:00:06    1302.2      0.00       0.0     364.0 MEM_1/rw_96x8_sync_u/net38348
    0:00:06    1301.9      0.00       0.0     357.4 MEM_1/rw_96x8_sync_u/net34849
    0:00:06    1299.1      0.00       0.0     346.6 MEM_1/rw_96x8_sync_u/net34939
    0:00:07    1297.6      0.00       0.0     340.8 MEM_1/rw_96x8_sync_u/net34987
    0:00:07    1294.7      0.00       0.0     330.1 MEM_1/rw_96x8_sync_u/net35077
    0:00:07    1293.4      0.00       0.0     325.0                          


  Beginning Area-Recovery Phase  (cleanup)
  -----------------------------

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:07    1293.4      0.00       0.0     325.0                          
    0:00:07    1293.4      0.00       0.0     325.0                          
    0:00:08    1264.8      0.00       0.0     322.6                          
    0:00:08    1260.5      0.00       0.0     322.6                          
    0:00:09    1259.7      0.00       0.0     322.6                          
    0:00:09    1258.9      0.00       0.0     318.6                          
    0:00:09    1258.2      0.00       0.0     318.2                          
    0:00:10    1258.1      0.00       0.0     317.7                          
    0:00:10    1257.9      0.00       0.0     317.6                          
    0:00:10    1257.8      0.00       0.0     317.6                          
    0:00:11    1257.6      0.00       0.0     317.5                          
    0:00:11    1257.6      0.00       0.0     317.5                          
    0:00:11    1257.5      0.00       0.0     317.5                          
    0:00:12    1257.4      0.00       0.0     317.5                          
    0:00:12    1257.4      0.00       0.0     317.5                          
    0:00:12    1257.3      0.00       0.0     317.5                          
    0:00:12    1257.2      0.00       0.0     317.5                          
    0:00:13    1257.1      0.00       0.0     317.5                          
    0:00:13    1257.1      0.00       0.0     317.5                          
    0:00:13    1257.1      0.00       0.0     317.5                          
    0:00:13    1257.1      0.00       0.0     317.5                          
    0:00:13    1257.1      0.00       0.0     317.5                          
    0:00:13    1257.1      0.00       0.0     317.5                          
    0:00:13    1257.1      0.00       0.0     317.5                          
    0:00:13    1257.1      0.00       0.0     317.5                          
Loading db file '/work/aigbe/syn/q6chip/syn/runs1/brcm3_test_240725/PC_project/db/sclib_tigfet10_hpnw4_tt_0p70v_25c.db'


Note: Symbol # after min delay cost means estimated hold TNS across all active scenarios 


  Optimization Complete
  ---------------------
1
dc_shell> write_file -hierarchy -output results/computer.ddc
Writing ddc file 'results/computer.ddc'.
1
dc_shell> change_name -rules verilog -hier
Warning: In the design ALU, net 'NZVC[3]' is connecting multiple ports. (UCN-1)
1
dc_shell> write_file -format verilog -hierarchy -output results/computer.v
Writing verilog file '/work/aigbe/syn/q6chip/syn/runs1/brcm3_test_240725/PC_project/results/computer.v'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
1
dc_shell> 
dc_shell> exit

Memory usage for this session 140 Mbytes.
Memory usage for this session including child processes 140 Mbytes.
CPU usage for this session 15 seconds ( 0.00 hours ).
Elapsed time for this session 102 seconds ( 0.03 hours ).

Thank you...
